func numIslands(grid [][]byte) int {
    rows := len(grid)
	cols := len(grid[0])
	islands := 0

	var dfs func(r,c int)
	dfs = func(r, c int) {
		// контракт - що робить ця fn для поточного вузла (координати) -> топить її
		// base case - перевіряємо чи дані в рамках нашої сітки, чи це не нуль
		// leap of faith - що я отримую від дітей (нічого, роблю все те саме - припускаю що вони все зроблять правильно, якщо для одного вузла правильно)
		// combine - нам нічого вертати не треба, бо ми мутуємо наш грід який в циклі.

		if r < 0 || r >= rows || c < 0 || c >= cols || grid[r][c] == '0' {
			return
		}

		grid[r][c] = '0' // що я роблю для поточного вузла - топлю його
		
		// leap of faith - діти роблять все те саме - поведінка така сама бо це ті самі вузли - зупинка на base case.
		dfs(r + 1, c)
		dfs(r - 1, c)
		dfs(r, c + 1)
		dfs(r, c - 1)
	}

	for r := 0; r < rows; r++ {
		for c := 0; c < cols; c++ {
			if grid[r][c] == '1' {
				dfs(r,c) // топлю всю сушу яка прилягає до цих кординат, і його прилеглих сторін відповідно
				islands++
			}
		}
	}

	return islands
}
