/**
 * Definition for a binary tree node.
 * type TreeNode struct {
 *     Val int
 *     Left *TreeNode
 *     Right *TreeNode
 * }
 */

/*
0. Чи потрібна поточному вузлу інформація від батьків?

   Так.

   Поточний вузол повинен знати,
   в яких межах він може знаходитись.

   Тому контракт стає:

        dfs(root, min, max)

------------------------------------------------------------

1. Контракт (що робить dfs для поточного вузла?)

   - перевіряє, чи поточний вузол
     задовольняє умову BST:

        min < root.Val < max

   - якщо так,
     передає нові межі своїм дітям.

------------------------------------------------------------

2. Що повертає?

   - bool.

   - true  -> все піддерево з коренем root
              є правильним BST.

   - false -> у цьому піддереві
              знайдено порушення BST.

------------------------------------------------------------

3. Base case для поточного вузла

   if root == nil {
       return true
   }

   - порожнє дерево завжди є BST.

------------------------------------------------------------

4. Leap of faith (що роблять діти?)

   dfs(root.Left, min, root.Val)

   - правильно перевірить,
     чи все ліве піддерево
     є правильним BST.

   dfs(root.Right, root.Val, max)

   - правильно перевірить,
     чи все праве піддерево
     є правильним BST.

   Ми не думаємо,
   як вони це перевірять.
   Ми довіряємо їхньому контракту.

------------------------------------------------------------

5. Combine (що роблю для поточного вузла?)

   1. Спочатку перевіряю,
      чи поточний вузол
      знаходиться в допустимих межах.

        min < root.Val < max

      Якщо ні:

        return false

   2. Якщо так,
      запускаю перевірку дітей
      з новими межами.

        Left:
            (min, root.Val)

        Right:
            (root.Val, max)

   3. Поточне дерево є BST,
      тільки якщо:

        isLeftOK &&
        isRightOK

------------------------------------------------------------

Ідея задачі:

   Кожен вузол не знає,
   які обмеження були встановлені
   його предками.

   Тому ми "несемо" вниз
   допустимі межі.

           (min, max)
                |
                v
             root.Val

   Ліва дитина отримує:

        (min, root.Val)

   Права дитина отримує:

        (root.Val, max)

   Таким чином кожен вузол
   знає, які значення йому дозволені.
*/

func isValidBST(root *TreeNode) bool {
	min, max := -1001, 1001
	var dfs func(root *TreeNode, min, max int) bool
	dfs = func(root *TreeNode, min, max int) bool {
		if root == nil {
			return true
		}

		if root.Val >= max || root.Val <= min {
			return false
		}

		isLeftOK := dfs(root.Left, min, root.Val)
		isRightOK := dfs(root.Right, root.Val, max)

		return isLeftOK && isRightOK
	}

    return dfs(root, min, max)

}
